src/ex_Tabakon/DataProcessors/ТБКЧатУТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ТБКЧатУТ</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Чат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сообщение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>999</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прочитано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/ex_Tabakon/Catalogs/ТБКСообщенияУТРозница.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ТБКСообщенияУТРозница</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ex_Tabakon/DataProcessors/ТБКЧатУТ/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ОтправитьНаСервере()
	Попытка
		Массив = ПолучитьИзВременногоХранилища(Адрес_ВебСоединение);
		Прокси	=	Массив[0];
	Исключение
		Прокси	=	Неопределено;	
	КонецПопытки;

	Если Прокси = Неопределено тогда	
		Прокси = ОбщегоНазначенияВызовСервера.ПолучитьПрокси("123456", "WS_User", "http://mx.tbkon.ru:1777/ut/ws/tbk?wsdl");
		Если Прокси <> Неопределено тогда
			Массив	=	новый Массив;
			Массив.Добавить(Прокси);
			Адрес_ВебСоединение	=	ПоместитьВоВременноеХранилище(Массив,ЭтаФорма.УникальныйИдентификатор); 
		КонецЕсли;
	КонецЕсли;
	
	Идент			=	Строка(Новый УникальныйИдентификатор);
	флУспех			=	Неопределено;
	НужДат			=	ТекущаяДата();
	НужОтправитель	=	Строка(Пользователи.ТекущийПользователь());
	
	
	Если Прокси <> Неопределено тогда
		
		эл	=	Новый Структура;
		эл.Вставить("Отправитель",НужОтправитель);
		эл.Вставить("Дата",Строка(НужДат));
		эл.Вставить("Магазин",Строка(ОбщегоНазначения.ПолучитьМагазин()));
		эл.Вставить("ИдентификаторСообщения",Идент);
		эл.Вставить("Сообщение",Сообщение);

		JS = ОбщегоНазначения.СтруктураВjson_Общая(эл);

		флУспех	=	Прокси.WriteMessage(JS);
		
		Если флУспех = "Истина" тогда
			НовыйЭл							=	Справочники.ТБКСообщенияУТРозница.СоздатьЭлемент();
			НовыйЭл.Дата					=	НужДат;
			НовыйЭл.Отправитель				=	НужОтправитель;
			НовыйЭл.Сообщение				=	Сообщение;
			НовыйЭл.Отправлено				=	Истина;
			НовыйЭл.ИдентификаторСообщения	=	Идент;
			НовыйЭл.Записать();
			
			НоваяСтрока	=	Объект.Чат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,НовыйЭл);

			Элементы.ТабличнаяЧасть1.ТекущаяСтрока	=	НоваяСтрока.ПолучитьИдентификатор();

			Сообщение	=	"";  
		иначе
			Сообщить("Не удалось отправить сообщение! " + флУспех);
		КонецЕсли;		
		
	КонецЕсли;	
	

КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	Если СокрЛП(Сообщение) <>"" тогда
		ОтправитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ТБКСообщенияУТРозница.Дата КАК Дата,
	      	 	             |	ТБКСообщенияУТРозница.Отправитель КАК Отправитель,
	      	 	             |	ТБКСообщенияУТРозница.Сообщение КАК Сообщение,
	      	 	             |	ТБКСообщенияУТРозница.Прочитано КАК Прочитано,
	      	 	             |	ТБКСообщенияУТРозница.Отправлено КАК Отправлено
	      	 	             |ИЗ
	      	 	             |	Справочник.ТБКСообщенияУТРозница КАК ТБКСообщенияУТРозница
	      	 	             |ГДЕ
	      	 	             |	ТБКСообщенияУТРозница.Дата >= &Дата
	      	 	             |	И НЕ ТБКСообщенияУТРозница.ПометкаУдаления
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	Дата,
	      	 	             |	Отправитель");
	Запрос.УстановитьПараметр("Дата",ТекущаяДата() - 90*24*60*60);
	Рез	=	Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 тогда Возврат КонецЕсли;
	Объект.Чат.Загрузить(Рез);
	
	
	Элементы.ТабличнаяЧасть1.ТекущаяСтрока	=	Объект.Чат[Рез.Количество()-1].ПолучитьИдентификатор();

	
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ТБКСообщенияУТРозница.Ссылка КАК Ссылка,
	      	 	             |	ТБКСообщенияУТРозница.ИдентификаторСообщения КАК ИдентификаторСообщения
	      	 	             |ИЗ
	      	 	             |	Справочник.ТБКСообщенияУТРозница КАК ТБКСообщенияУТРозница
	      	 	             |ГДЕ
	      	 	             |	ТБКСообщенияУТРозница.Отправитель = &Отправитель
	      	 	             |	И НЕ ТБКСообщенияУТРозница.Прочитано");
	Запрос.УстановитьПараметр("Отправитель","Офис");
	Рез = Запрос.Выполнить().Выбрать();
	
	Прокси  = ОбщегоНазначенияВызовСервера.ПолучитьПрокси("123456", "WS_User", "http://mx.tbkon.ru:1777/ut/ws/tbk?wsdl", 10, Истина);
	Массив	=	новый Массив;
	Массив.Добавить(Прокси);
	Адрес_ВебСоединение	=	ПоместитьВоВременноеХранилище(Массив,ЭтаФорма.УникальныйИдентификатор); 

	//	
	//Если Рез.Количество()>0 тогда
	//	Прокси = ОбщегоНазначенияВызовСервера.ПолучитьПрокси("123456", "WS_User", "http://mx.tbkon.ru:1777/ut/ws/tbk?wsdl");
	//КонецЕсли;
	
	Если Прокси <> Неопределено тогда
		Пока Рез.Следующий() цикл
			флУспех	=	Прокси.WriteMessageTag(Рез.ИдентификаторСообщения);
			Если флУспех = "Истина" тогда
				Об	=	Рез.Ссылка.ПолучитьОбъект();	
				Об.Прочитано	=	Истина;
				Об.Записать();
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;	
	

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаНовыхСообщений() экспорт
	ПроверкаСообщенийнаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверкаСообщенийнаСервере()
  Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ТБКСообщенияУТРозница.Ссылка КАК Ссылка,
	      	 	             |	ТБКСообщенияУТРозница.ИдентификаторСообщения КАК ИдентификаторСообщения,
	      	 	             |	ТБКСообщенияУТРозница.Дата КАК Дата,
	      	 	             |	ТБКСообщенияУТРозница.Отправитель КАК Отправитель,
	      	 	             |	ТБКСообщенияУТРозница.Сообщение КАК Сообщение
	      	 	             |ИЗ
	      	 	             |	Справочник.ТБКСообщенияУТРозница КАК ТБКСообщенияУТРозница
	      	 	             |ГДЕ
	      	 	             |	ТБКСообщенияУТРозница.Отправитель = &Отправитель
	      	 	             |	И НЕ ТБКСообщенияУТРозница.Прочитано");
	Запрос.УстановитьПараметр("Отправитель","Офис");
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Количество() = 0 тогда
		Возврат
	КонецЕсли;
	
	Попытка
		Массив = ПолучитьИзВременногоХранилища(Адрес_ВебСоединение);
		Прокси	=	Массив[0];
	Исключение
		Прокси	=	Неопределено;	
	КонецПопытки;

	Если Прокси = Неопределено тогда	
		Прокси = ОбщегоНазначенияВызовСервера.ПолучитьПрокси("123456", "WS_User", "http://mx.tbkon.ru:1777/ut/ws/tbk?wsdl");
	КонецЕсли;

	Если Прокси <> Неопределено тогда
		Пока Рез.Следующий() цикл
			флУспех	=	Прокси.WriteMessageTag(Рез.ИдентификаторСообщения);
			Если флУспех = "Истина" тогда
				Об	=	Рез.Ссылка.ПолучитьОбъект();	
				Об.Прочитано	=	Истина;
				Об.Записать();
			КонецЕсли;
			
			НовСтрока	=	Объект.Чат.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока,Рез);
			НовСтрока.Отправлено = Истина;
			
			
			Элементы.ТабличнаяЧасть1.ТекущаяСтрока	=	Объект.Чат[Объект.Чат.Количество()-1].ПолучитьИдентификатор();

		КонецЦикла;		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Попытка
		Если не Адрес_ВебСоединение  = "" тогда
			Массив = ПолучитьИзВременногоХранилища(Адрес_ВебСоединение);
			Массив[0] = Неопределено;
		КонецЕсли;
	Исключение
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ПроверкаНовыхСообщений",20);
КонецПроцедуры

&НаКлиенте
Процедура СообщениеИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если Найти(Текст,символы.ПС) тогда
		Если СокрЛП(Текст) <>"" тогда 
			Сообщение	=	СтрЗаменить(Текст,символы.ПС,"");
			ОтправитьНаСервере();
		КонецЕсли;
	КонецЕсли;  
КонецПроцедуры
